def convert2(num2): #Первая функция для описания первой части числа деленного на 1000 в словесной форме
    units2 = ("", "одна ", "две ", "три ", "четыре ", "пять ", "шесть ", "семь ", "восемь ", "девять ", "десять ",
             "одиннадцать ", "двенадцать ", "тринадцать ", "четырнадцать ", "пятнадцать ", "шестьнадцать ",
             "семнадцать ", "восемнадцать ", "девятьнадцать ")
    tens2 = ("", "", "двадцать ", "тридцать ", "сорок ", "пятьдесят ",
           "шестьдесят ", "семьдесят ", "восемьдесят ", "девяносто ")
    hundreds2 = ("", "сто ", "двести ", "тристо ", "четыресто ", "пятьсот ",
                 "шестьсот ", "семьсот ", "восемьсот ", "девятьсот ")
    if num2 < 20: #Рекурсия
        return units2[num2]л
    if num2 < 100:
        return tens2[num2 // 10] + units2[int(num2 % 10)]
    if num2 < 1000:
        return hundreds2[num2 // 100] + convert2(int(num2 % 100))


def convert(num): #Вторая функция для описания второй части числа функции деленного на 1000 в словесной форме и обьеденинения 1 и 2 функциии
    units = ("", "один ", "два ", "три ", "четыре ", "пять ", "шесть ", "семь ", "восемь ", "девять ", "десять ",
             "одиннадцать ", "двенадцать ", "тринадцать ", "четырнадцать ", "пятнадцать ", "шестьнадцать ",
             "семнадцать ", "восемнадцать ", "девятьнадцать ")
    units1 = ("", "одна ", "две ", "три ", "четыре ")
    tens = ("", "", "двадцать ", "тридцать ", "сорок ", "пятьдесят ",
            "шестьдесят ", "семьдесят ", "восемьдесят ", "девяносто ")
    hundreds = ("", "сто ", "двести ", "тристо ", "четыресто ", "пятьсот ",
                "шестьсот ", "семьсот ", "восемьсот ", "девятьсот ")
    d = (num // 1000) % 10
    if num < 20: 
        return units[num]
    if num < 100:
        return tens[num // 10] + units[int(num % 10)]
    if num < 1000:
        return hundreds[num // 100] + convert(int(num % 100))
    if num < 10000:   #Разбираемся с приставками тысяч и обьединяем функции
        if num < 2000:
            return units1[num // 1000] + "тысяча " + convert(int(num % 1000))
        if num < 5000:
            return units1[num // 1000] + "тысячи " + convert(int(num % 1000))
    if 20000 < num < 1000000 and d == 1:
        return convert2(num // 1000) + "тысяча " + convert(int(num % 1000))
    if 20000 < num < 100000 and 5 > d > 1:
        return convert2(num // 1000) + "тысячи " + convert(int(num % 1000))
    if 120000 < num < 1000000 and 5 > d > 1:
        return convert2(num // 1000) + "тысячи " + convert(int(num % 1000))
    if 120000 < num < 1000000 and d == 1:
        return convert2(num // 1000) + "тысяча " + convert(int(num % 1000))
    if num < 1000000:
        return convert2(num // 1000) + "тысяч " + convert(int(num % 1000))


while True:
    number = input("Чтобы запустить программу введите y, если хотите закончить n (Y/N):")
    if number == "n" or number == "N":
        break
    else:
        a = int(input("Введите чило от 1 до 999999"))
        if a < 1 or a > 999999:
            print("Введенное число не соответствует заданному диапазону")
        else:
            b = convert(a)
        if ((a % 100) > 10) and ((a % 100) < 15):
            print(b, "рублей")
        elif a % 10 == 1:
            print(b, "рубль")
        elif ((a % 10) > 1) and ((a % 10) < 5):
            print(b, "рубля")
        else:
            print(b, "рублей")
