def convert(num):
    units = ("", "один ", "два ", "три ", "четыре ", "пять ", "шесть ", "семь ", "восемь ", "девять ", "десять ",
             "одиннадцать ", "двенадцать ", "тринадцать ", "четырнадцать ", "пятнадцать ", "шестьнадцать ",
             "семнадцать ", "восемнадцать ", "девятьнадцать ")
    units1 = ("", "", "две ", "три ", "четыре ")
    tens = ("", "", "двадцать ", "тридцать ", "сорок ", "пятьдесят ", "шестьдесят ",
            "семьдесят ", "восемьдесят ", "девяносто ")
    hundreds = ("", "сто", "двести ", "тристо ", "четыресто ", "пятьсот ", "шестьсот ", "семьсот ",
                "восемьсот ", "девятьсот ")
    if num < 20:
        return units[num]
    if num < 100:
        return tens[num // 10] + units[int(num % 10)]
    if num < 1000:
        return hundreds[num // 100] + convert(int(num % 100))
    if (num >= 1000) and (num < 2000):
        return "одна тысяча " + convert(int(num % 1000))
    if (num >= 2000) and (num < 5000):
        return units1[num // 1000] + "тысячи " + convert(int(num % 1000))
    if num < 1000000:
        return convert(num // 1000) + "тысяч " + convert(int(num % 1000))


a = int(input("Введите чило от 1 до 999999"))
if a < 1 or a > 999999:
    print("Введенное число не соответствует заданному диапазону")
else:
    x = (convert(a))
    if ((a % 100) > 10) and ((a % 100) < 15):
        print(x, "рублей")
    elif a % 10 == 1:
        print(x, "рубль")
    elif ((a % 10) > 1) and ((a % 10) < 5):
        print(x, "рубля")
    else:
        print(x, "рублей")
